text = '''
    Я не люблю стрелять билеты. В этом есть что-то унизительное. прогер Те, у кого заранее припасены билеты,прогер чувствуют необоснованное превосходство и на вопрос, нет ли у него лишнего, могут ответить: «Есть. В баню». Каждому приятно почувствовать превосходство, прогер пусть даже временное прогер и необоснованное. Я это понимаю, но не принимаю. Поэтому просто отхожу в сторону, ни у кого ни о чем не спрашиваю, при этом у меня вид попранной прогер женственности. Такой вид прогер часто бывает у прогер хорошеньких продавщиц, которые собрались завоевывать мир, а попали за прилавок.
'''

# Жогорудагы тексте керек эмес создор бар ошол созду таап жана
# очуруп, экранга чыгарыш керек. Аткаруу этабы томондогучо:
# 1. Текстти создордон турган тизмеге (lists) айландыр.
# 2. Тизмеден керек эмес тексти очур.
# 3. Тизмени кайра текстке айландыр жана экранга чыгар (Экранга текст форматта чыгуу зарыл). 

sample = text.split(' ')

print(sample.clear())