mesto = {
    'Дархан',
    'Манас-Ата',
    'Палван-Ата',
    'Караван',
    'Баарына кошулам',
    'Офис',
    'Фаиза'
}

meats = {
    'Аш',
    'Пицца',
    'Пирожок',
    'Ачуу-Эт',
    'Лагман',
    'Мясной рулет',
    'Ташкентский Аш',
    'Шашлык',
    'Стейк',
    'Тиббон'
}

mesto_1 = mesto.pop()
meats_1 = meats.pop()

print('Место: ', mesto_1)
print('Еда: ', meats_1)

# ФАИЗА
# -- 1 -- #
# 1. Мясной рулет 5 табак 3кг. 4500 сом 
# 2. Суу 300 сом
# 3. Нан 160 сом
# 4. Сузмо 150 сом


# Палван Ата
# -- 2 -- #
# 1. Аш 2кг 2400 сом
# 2. Суу 300 сом
# 3. Нан 100 сом
# 4. Салат 300 сом
# 5. Чай 100 сом