# Задача 3.
# Написать функцию deposit(money, year) который прибавляет, к деньгам money, 15% от money.
# 1 аргумент это сумма деген которые мы хотим вложит в депозит
# 2 аргумент срок депозита
# Функция должна вычислить депозит на year лет
# Вызов: deposit(50000, 2)
# Вывод: За 2 года деньги увеличились на 65000

# def deposit(money, year):
#     depo_st = (money * 0.15) * year
#     result = money + depo_st

#     print('За {0} года деньги увеличились на {1} '.format(year, result))

# mon = int(input('Кол денег на депозит ставка 15% за год: '))
# year = int(input('На сколько лет: '))

# deposit(mon, year)