
def perimetr(p):
    return p * 4

def aiant(s):
    return (s + s) ** 2


# Найти кол-во секунд year_count в году
def get_second(year_count):
    pass


p = int(input('Введите сторону квадрата: '))

x = perimetr(p)
s = aiant(p)

print('Периметр:', x)
print('Аянты:', s)