
# 1. Найти сумму ряда чисел от 1 до 100. Полученный результат вывести на экран; Например, 0+1+2+3+4+5+6+7…+100 = 4950

# sum = 0
# for i in range(100):
#     sum = sum + i
# print('Сумма от 1 до 100:', sum)


# 2. Найти все число делящееся на 7 без остатка из ряда чисел от 7 до 457 и вывести на экран

# for i in range(7, 458):
#     if i % 7 == 0:
#         print(i)


# 3. Дан список(Lists): 
# Посчитать сумму чисел из списка numbers

# numbers = [ 67, 99, 56, 43, 66, 12 ]
# sum = 0
# for j in range(6):
#     sum = sum + numbers[j]
# print(sum)

# 4. Дан список(Lists): 
# Посчитать сумму только отрицательных чисел из списка numbersOff

# numbersOff = [548, -23, 34, -77, 0, 12, -5, 36, -34, -60, 3, -9]
# sum = 0
# for i in range(12):
#     if numbersOff[i] < 0:
#         sum = sum + numbersOff[i]
# print(sum)

# 5. Вывести на экран все чётные значения в диапазоне от 1 до 100;
# for z in range(101):
#     if z % 2 == 0:
#         print(z)

# 6. Вывести на экран все нечётные значения в диапазоне от 1 до 100;
# for z in range(101):
#     if z % 2 != 0:
#         print(z)

# 7. Перемножить все не чётные значения в диапазоне от 1 до 943
# sum = 1
# for i in range(100):
#     if i % 2 != 0:
#         sum = sum * i
# print(sum)

# 8. Записать в список(Lists) все числа в диапазоне от 10 до 100;

# mylists = []
# for i in range(10, 100):
#     mylists.append(i)
# print(mylists)
